GopalSaraf/Practicals/PSDL/include/proc/pic18lf4685.inc
// Register: RXF10SIDL
#define RXF10SIDL RXF10SIDL
RXF10SIDL                                equ 0D75h
// bitfield definitions
RXF10SIDL_EID16_POSN                     equ 0000h
RXF10SIDL_EID16_POSITION                 equ 0000h
RXF10SIDL_EID16_SIZE                     equ 0001h
RXF10SIDL_EID16_LENGTH                   equ 0001h
RXF10SIDL_EID16_MASK                     equ 0001h
RXF10SIDL_EID17_POSN                     equ 0001h
RXF10SIDL_EID17_POSITION                 equ 0001h
RXF10SIDL_EID17_SIZE                     equ 0001h
RXF10SIDL_EID17_LENGTH                   equ 0001h
RXF10SIDL_EID17_MASK                     equ 0002h
RXF10SIDL_EXIDEN_POSN                    equ 0003h
RXF10SIDL_EXIDEN_POSITION                equ 0003h
RXF10SIDL_EXIDEN_SIZE                    equ 0001h
RXF10SIDL_EXIDEN_LENGTH                  equ 0001h
RXF10SIDL_EXIDEN_MASK                    equ 0008h
RXF10SIDL_SID0_POSN                      equ 0005h
RXF10SIDL_SID0_POSITION                  equ 0005h
RXF10SIDL_SID0_SIZE                      equ 0001h
RXF10SIDL_SID0_LENGTH                    equ 0001h
RXF10SIDL_SID0_MASK                      equ 0020h
RXF10SIDL_SID1_POSN                      equ 0006h
RXF10SIDL_SID1_POSITION                  equ 0006h
RXF10SIDL_SID1_SIZE                      equ 0001h
RXF10SIDL_SID1_LENGTH                    equ 0001h
RXF10SIDL_SID1_MASK                      equ 0040h
RXF10SIDL_SID2_POSN                      equ 0007h
RXF10SIDL_SID2_POSITION                  equ 0007h
RXF10SIDL_SID2_SIZE                      equ 0001h
RXF10SIDL_SID2_LENGTH                    equ 0001h
RXF10SIDL_SID2_MASK                      equ 0080h
RXF10SIDL_EXIDE_POSN                     equ 0003h
RXF10SIDL_EXIDE_POSITION                 equ 0003h
RXF10SIDL_EXIDE_SIZE                     equ 0001h
RXF10SIDL_EXIDE_LENGTH                   equ 0001h
RXF10SIDL_EXIDE_MASK                     equ 0008h
RXF10SIDL_RXF10EID16_POSN                equ 0000h
RXF10SIDL_RXF10EID16_POSITION            equ 0000h
RXF10SIDL_RXF10EID16_SIZE                equ 0001h
RXF10SIDL_RXF10EID16_LENGTH              equ 0001h
RXF10SIDL_RXF10EID16_MASK                equ 0001h
RXF10SIDL_RXF10EID17_POSN                equ 0001h
RXF10SIDL_RXF10EID17_POSITION            equ 0001h
RXF10SIDL_RXF10EID17_SIZE                equ 0001h
RXF10SIDL_RXF10EID17_LENGTH              equ 0001h
RXF10SIDL_RXF10EID17_MASK                equ 0002h
RXF10SIDL_RXF10EXIDEN_POSN               equ 0003h
RXF10SIDL_RXF10EXIDEN_POSITION           equ 0003h
RXF10SIDL_RXF10EXIDEN_SIZE               equ 0001h
RXF10SIDL_RXF10EXIDEN_LENGTH             equ 0001h
RXF10SIDL_RXF10EXIDEN_MASK               equ 0008h
RXF10SIDL_RXF10SID0_POSN                 equ 0005h
RXF10SIDL_RXF10SID0_POSITION             equ 0005h
RXF10SIDL_RXF10SID0_SIZE                 equ 0001h
RXF10SIDL_RXF10SID0_LENGTH               equ 0001h
RXF10SIDL_RXF10SID0_MASK                 equ 0020h
RXF10SIDL_RXF10SID1_POSN                 equ 0006h
RXF10SIDL_RXF10SID1_POSITION             equ 0006h
RXF10SIDL_RXF10SID1_SIZE                 equ 0001h
RXF10SIDL_RXF10SID1_LENGTH               equ 0001h
RXF10SIDL_RXF10SID1_MASK                 equ 0040h
RXF10SIDL_RXF10SID2_POSN                 equ 0007h
RXF10SIDL_RXF10SID2_POSITION             equ 0007h
RXF10SIDL_RXF10SID2_SIZE                 equ 0001h
RXF10SIDL_RXF10SID2_LENGTH               equ 0001h
RXF10SIDL_RXF10SID2_MASK                 equ 0080h

// Register: RXF10EIDH
#define RXF10EIDH RXF10EIDH
RXF10EIDH                                equ 0D76h
// bitfield definitions
RXF10EIDH_EID8_POSN                      equ 0000h
RXF10EIDH_EID8_POSITION                  equ 0000h
RXF10EIDH_EID8_SIZE                      equ 0001h
RXF10EIDH_EID8_LENGTH                    equ 0001h
RXF10EIDH_EID8_MASK                      equ 0001h
RXF10EIDH_EID9_POSN                      equ 0001h
RXF10EIDH_EID9_POSITION                  equ 0001h
RXF10EIDH_EID9_SIZE                      equ 0001h
RXF10EIDH_EID9_LENGTH                    equ 0001h
RXF10EIDH_EID9_MASK                      equ 0002h
RXF10EIDH_EID10_POSN                     equ 0002h
RXF10EIDH_EID10_POSITION                 equ 0002h
RXF10EIDH_EID10_SIZE                     equ 0001h
RXF10EIDH_EID10_LENGTH                   equ 0001h
RXF10EIDH_EID10_MASK                     equ 0004h
RXF10EIDH_EID11_POSN                     equ 0003h
RXF10EIDH_EID11_POSITION                 equ 0003h
RXF10EIDH_EID11_SIZE                     equ 0001h
RXF10EIDH_EID11_LENGTH                   equ 0001h
RXF10EIDH_EID11_MASK                     equ 0008h
RXF10EIDH_EID12_POSN                     equ 0004h
RXF10EIDH_EID12_POSITION                 equ 0004h
RXF10EIDH_EID12_SIZE                     equ 0001h
RXF10EIDH_EID12_LENGTH                   equ 0001h
RXF10EIDH_EID12_MASK                     equ 0010h
RXF10EIDH_EID13_POSN                     equ 0005h
RXF10EIDH_EID13_POSITION                 equ 0005h
RXF10EIDH_EID13_SIZE                     equ 0001h
RXF10EIDH_EID13_LENGTH                   equ 0001h
RXF10EIDH_EID13_MASK                     equ 0020h
RXF10EIDH_EID14_POSN                     equ 0006h
RXF10EIDH_EID14_POSITION                 equ 0006h
RXF10EIDH_EID14_SIZE                     equ 0001h
RXF10EIDH_EID14_LENGTH                   equ 0001h
RXF10EIDH_EID14_MASK                     equ 0040h
RXF10EIDH_EID15_POSN                     equ 0007h
RXF10EIDH_EID15_POSITION                 equ 0007h
RXF10EIDH_EID15_SIZE                     equ 0001h
RXF10EIDH_EID15_LENGTH                   equ 0001h
RXF10EIDH_EID15_MASK                     equ 0080h
RXF10EIDH_RXF10EID8_POSN                 equ 0000h
RXF10EIDH_RXF10EID8_POSITION             equ 0000h
RXF10EIDH_RXF10EID8_SIZE                 equ 0001h
RXF10EIDH_RXF10EID8_LENGTH               equ 0001h
RXF10EIDH_RXF10EID8_MASK                 equ 0001h
RXF10EIDH_RXF10EID9_POSN                 equ 0001h
RXF10EIDH_RXF10EID9_POSITION             equ 0001h
RXF10EIDH_RXF10EID9_SIZE                 equ 0001h
RXF10EIDH_RXF10EID9_LENGTH               equ 0001h
RXF10EIDH_RXF10EID9_MASK                 equ 0002h
RXF10EIDH_RXF10EID10_POSN                equ 0002h
RXF10EIDH_RXF10EID10_POSITION            equ 0002h
RXF10EIDH_RXF10EID10_SIZE                equ 0001h
RXF10EIDH_RXF10EID10_LENGTH              equ 0001h
RXF10EIDH_RXF10EID10_MASK                equ 0004h
RXF10EIDH_RXF10EID11_POSN                equ 0003h
RXF10EIDH_RXF10EID11_POSITION            equ 0003h
RXF10EIDH_RXF10EID11_SIZE                equ 0001h
RXF10EIDH_RXF10EID11_LENGTH              equ 0001h
RXF10EIDH_RXF10EID11_MASK                equ 0008h
RXF10EIDH_RXF10EID12_POSN                equ 0004h
RXF10EIDH_RXF10EID12_POSITION            equ 0004h
RXF10EIDH_RXF10EID12_SIZE                equ 0001h
RXF10EIDH_RXF10EID12_LENGTH              equ 0001h
RXF10EIDH_RXF10EID12_MASK                equ 0010h
RXF10EIDH_RXF10EID13_POSN                equ 0005h
RXF10EIDH_RXF10EID13_POSITION            equ 0005h
RXF10EIDH_RXF10EID13_SIZE                equ 0001h
RXF10EIDH_RXF10EID13_LENGTH              equ 0001h
RXF10EIDH_RXF10EID13_MASK                equ 0020h
RXF10EIDH_RXF10EID14_POSN                equ 0006h
RXF10EIDH_RXF10EID14_POSITION            equ 0006h
RXF10EIDH_RXF10EID14_SIZE                equ 0001h
RXF10EIDH_RXF10EID14_LENGTH              equ 0001h
RXF10EIDH_RXF10EID14_MASK                equ 0040h
RXF10EIDH_RXF10EID15_POSN                equ 0007h
RXF10EIDH_RXF10EID15_POSITION            equ 0007h
RXF10EIDH_RXF10EID15_SIZE                equ 0001h
RXF10EIDH_RXF10EID15_LENGTH              equ 0001h
RXF10EIDH_RXF10EID15_MASK                equ 0080h

// Register: RXF10EIDL
#define RXF10EIDL RXF10EIDL
RXF10EIDL                                equ 0D77h
// bitfield definitions
RXF10EIDL_EID0_POSN                      equ 0000h
RXF10EIDL_EID0_POSITION                  equ 0000h
RXF10EIDL_EID0_SIZE                      equ 0001h
RXF10EIDL_EID0_LENGTH                    equ 0001h
RXF10EIDL_EID0_MASK                      equ 0001h
RXF10EIDL_EID1_POSN                      equ 0001h
RXF10EIDL_EID1_POSITION                  equ 0001h
RXF10EIDL_EID1_SIZE                      equ 0001h
RXF10EIDL_EID1_LENGTH                    equ 0001h
RXF10EIDL_EID1_MASK                      equ 0002h
RXF10EIDL_EID2_POSN                      equ 0002h
RXF10EIDL_EID2_POSITION                  equ 0002h
RXF10EIDL_EID2_SIZE                      equ 0001h
RXF10EIDL_EID2_LENGTH                    equ 0001h
RXF10EIDL_EID2_MASK                      equ 0004h
RXF10EIDL_EID3_POSN                      equ 0003h
RXF10EIDL_EID3_POSITION                  equ 0003h
RXF10EIDL_EID3_SIZE                      equ 0001h
RXF10EIDL_EID3_LENGTH                    equ 0001h
RXF10EIDL_EID3_MASK                      equ 0008h
RXF10EIDL_EID4_POSN                      equ 0004h
RXF10EIDL_EID4_POSITION                  equ 0004h
RXF10EIDL_EID4_SIZE                      equ 0001h
RXF10EIDL_EID4_LENGTH                    equ 0001h
RXF10EIDL_EID4_MASK                      equ 0010h
RXF10EIDL_EID5_POSN                      equ 0005h
RXF10EIDL_EID5_POSITION                  equ 0005h
RXF10EIDL_EID5_SIZE                      equ 0001h
RXF10EIDL_EID5_LENGTH                    equ 0001h
RXF10EIDL_EID5_MASK                      equ 0020h
RXF10EIDL_EID6_POSN                      equ 0006h
RXF10EIDL_EID6_POSITION                  equ 0006h
RXF10EIDL_EID6_SIZE                      equ 0001h
RXF10EIDL_EID6_LENGTH                    equ 0001h
RXF10EIDL_EID6_MASK                      equ 0040h
RXF10EIDL_EID7_POSN                      equ 0007h
RXF10EIDL_EID7_POSITION                  equ 0007h
RXF10EIDL_EID7_SIZE                      equ 0001h
RXF10EIDL_EID7_LENGTH                    equ 0001h
RXF10EIDL_EID7_MASK                      equ 0080h
RXF10EIDL_RXF10EID0_POSN                 equ 0000h
RXF10EIDL_RXF10EID0_POSITION             equ 0000h
RXF10EIDL_RXF10EID0_SIZE                 equ 0001h
RXF10EIDL_RXF10EID0_LENGTH               equ 0001h
RXF10EIDL_RXF10EID0_MASK                 equ 0001h
RXF10EIDL_RXF10EID1_POSN                 equ 0001h
RXF10EIDL_RXF10EID1_POSITION             equ 0001h
RXF10EIDL_RXF10EID1_SIZE                 equ 0001h
RXF10EIDL_RXF10EID1_LENGTH               equ 0001h
RXF10EIDL_RXF10EID1_MASK                 equ 0002h
RXF10EIDL_RXF10EID2_POSN                 equ 0002h
RXF10EIDL_RXF10EID2_POSITION             equ 0002h
RXF10EIDL_RXF10EID2_SIZE                 equ 0001h
RXF10EIDL_RXF10EID2_LENGTH               equ 0001h
RXF10EIDL_RXF10EID2_MASK                 equ 0004h
RXF10EIDL_RXF10EID3_POSN                 equ 0003h
RXF10EIDL_RXF10EID3_POSITION             equ 0003h
RXF10EIDL_RXF10EID3_SIZE                 equ 0001h
RXF10EIDL_RXF10EID3_LENGTH               equ 0001h
RXF10EIDL_RXF10EID3_MASK                 equ 0008h
RXF10EIDL_RXF10EID4_POSN                 equ 0004h
RXF10EIDL_RXF10EID4_POSITION             equ 0004h
RXF10EIDL_RXF10EID4_SIZE                 equ 0001h
RXF10EIDL_RXF10EID4_LENGTH               equ 0001h
RXF10EIDL_RXF10EID4_MASK                 equ 0010h
RXF10EIDL_RXF10EID5_POSN                 equ 0005h
RXF10EIDL_RXF10EID5_POSITION             equ 0005h
RXF10EIDL_RXF10EID5_SIZE                 equ 0001h
RXF10EIDL_RXF10EID5_LENGTH               equ 0001h
RXF10EIDL_RXF10EID5_MASK                 equ 0020h
RXF10EIDL_RXF10EID6_POSN                 equ 0006h
RXF10EIDL_RXF10EID6_POSITION             equ 0006h
RXF10EIDL_RXF10EID6_SIZE                 equ 0001h
RXF10EIDL_RXF10EID6_LENGTH               equ 0001h
RXF10EIDL_RXF10EID6_MASK                 equ 0040h
RXF10EIDL_RXF10EID7_POSN                 equ 0007h
RXF10EIDL_RXF10EID7_POSITION             equ 0007h
RXF10EIDL_RXF10EID7_SIZE                 equ 0001h
RXF10EIDL_RXF10EID7_LENGTH               equ 0001h
RXF10EIDL_RXF10EID7_MASK                 equ 0080h

// Register: RXF11SIDH
#define RXF11SIDH RXF11SIDH
RXF11SIDH                                equ 0D78h
// bitfield definitions
RXF11SIDH_SID3_POSN                      equ 0000h
RXF11SIDH_SID3_POSITION                  equ 0000h
RXF11SIDH_SID3_SIZE                      equ 0001h
RXF11SIDH_SID3_LENGTH                    equ 0001h
RXF11SIDH_SID3_MASK                      equ 0001h
RXF11SIDH_SID4_POSN                      equ 0001h
RXF11SIDH_SID4_POSITION                  equ 0001h
RXF11SIDH_SID4_SIZE                      equ 0001h
RXF11SIDH_SID4_LENGTH                    equ 0001h
RXF11SIDH_SID4_MASK                      equ 0002h
RXF11SIDH_SID5_POSN                      equ 0002h
RXF11SIDH_SID5_POSITION                  equ 0002h
RXF11SIDH_SID5_SIZE                      equ 0001h
RXF11SIDH_SID5_LENGTH                    equ 0001h
RXF11SIDH_SID5_MASK                      equ 0004h
RXF11SIDH_SID6_POSN                      equ 0003h
RXF11SIDH_SID6_POSITION                  equ 0003h
RXF11SIDH_SID6_SIZE                      equ 0001h
RXF11SIDH_SID6_LENGTH                    equ 0001h
RXF11SIDH_SID6_MASK                      equ 0008h
RXF11SIDH_SID7_POSN                      equ 0004h
RXF11SIDH_SID7_POSITION                  equ 0004h
RXF11SIDH_SID7_SIZE                      equ 0001h
RXF11SIDH_SID7_LENGTH                    equ 0001h
RXF11SIDH_SID7_MASK                      equ 0010h
RXF11SIDH_SID8_POSN                      equ 0005h
RXF11SIDH_SID8_POSITION                  equ 0005h
RXF11SIDH_SID8_SIZE                      equ 0001h
RXF11SIDH_SID8_LENGTH                    equ 0001h
RXF11SIDH_SID8_MASK                      equ 0020h
RXF11SIDH_SID9_POSN                      equ 0006h
RXF11SIDH_SID9_POSITION                  equ 0006h
RXF11SIDH_SID9_SIZE                      equ 0001h
RXF11SIDH_SID9_LENGTH                    equ 0001h
RXF11SIDH_SID9_MASK                      equ 0040h
RXF11SIDH_SID10_POSN                     equ 0007h
RXF11SIDH_SID10_POSITION                 equ 0007h
RXF11SIDH_SID10_SIZE                     equ 0001h
RXF11SIDH_SID10_LENGTH                   equ 0001h
RXF11SIDH_SID10_MASK                     equ 0080h
RXF11SIDH_RXF11SID3_POSN                 equ 0000h
RXF11SIDH_RXF11SID3_POSITION             equ 0000h
RXF11SIDH_RXF11SID3_SIZE                 equ 0001h
RXF11SIDH_RXF11SID3_LENGTH               equ 0001h
RXF11SIDH_RXF11SID3_MASK                 equ 0001h
RXF11SIDH_RXF11SID4_POSN                 equ 0001h
RXF11SIDH_RXF11SID4_POSITION             equ 0001h
RXF11SIDH_RXF11SID4_SIZE                 equ 0001h
RXF11SIDH_RXF11SID4_LENGTH               equ 0001h
RXF11SIDH_RXF11SID4_MASK                 equ 0002h
RXF11SIDH_RXF11SID5_POSN                 equ 0002h
RXF11SIDH_RXF11SID5_POSITION             equ 0002h
RXF11SIDH_RXF11SID5_SIZE                 equ 0001h
RXF11SIDH_RXF11SID5_LENGTH               equ 0001h
RXF11SIDH_RXF11SID5_MASK                 equ 0004h
RXF11SIDH_RXF11SID6_POSN                 equ 0003h
RXF11SIDH_RXF11SID6_POSITION             equ 0003h
RXF11SIDH_RXF11SID6_SIZE                 equ 0001h
RXF11SIDH_RXF11SID6_LENGTH               equ 0001h
RXF11SIDH_RXF11SID6_MASK                 equ 0008h
RXF11SIDH_RXF11SID7_POSN                 equ 0004h
RXF11SIDH_RXF11SID7_POSITION             equ 0004h
RXF11SIDH_RXF11SID7_SIZE                 equ 0001h
RXF11SIDH_RXF11SID7_LENGTH               equ 0001h
RXF11SIDH_RXF11SID7_MASK                 equ 0010h
RXF11SIDH_RXF11SID8_POSN                 equ 0005h
RXF11SIDH_RXF11SID8_POSITION             equ 0005h
RXF11SIDH_RXF11SID8_SIZE                 equ 0001h
RXF11SIDH_RXF11SID8_LENGTH               equ 0001h
RXF11SIDH_RXF11SID8_MASK                 equ 0020h
RXF11SIDH_RXF11SID9_POSN                 equ 0006h
RXF11SIDH_RXF11SID9_POSITION             equ 0006h
RXF11SIDH_RXF11SID9_SIZE                 equ 0001h
RXF11SIDH_RXF11SID9_LENGTH               equ 0001h
RXF11SIDH_RXF11SID9_MASK                 equ 0040h
RXF11SIDH_RXF11SID10_POSN                equ 0007h
RXF11SIDH_RXF11SID10_POSITION            equ 0007h
RXF11SIDH_RXF11SID10_SIZE                equ 0001h
RXF11SIDH_RXF11SID10_LENGTH              equ 0001h
RXF11SIDH_RXF11SID10_MASK                equ 0080h

