GopalSaraf/Practicals/PSDL/include/proc/pic18lf4685.inc
// Register: RXF15SIDL
#define RXF15SIDL RXF15SIDL
RXF15SIDL                                equ 0D91h
// bitfield definitions
RXF15SIDL_EID16_POSN                     equ 0000h
RXF15SIDL_EID16_POSITION                 equ 0000h
RXF15SIDL_EID16_SIZE                     equ 0001h
RXF15SIDL_EID16_LENGTH                   equ 0001h
RXF15SIDL_EID16_MASK                     equ 0001h
RXF15SIDL_EID17_POSN                     equ 0001h
RXF15SIDL_EID17_POSITION                 equ 0001h
RXF15SIDL_EID17_SIZE                     equ 0001h
RXF15SIDL_EID17_LENGTH                   equ 0001h
RXF15SIDL_EID17_MASK                     equ 0002h
RXF15SIDL_EXIDEN_POSN                    equ 0003h
RXF15SIDL_EXIDEN_POSITION                equ 0003h
RXF15SIDL_EXIDEN_SIZE                    equ 0001h
RXF15SIDL_EXIDEN_LENGTH                  equ 0001h
RXF15SIDL_EXIDEN_MASK                    equ 0008h
RXF15SIDL_SID0_POSN                      equ 0005h
RXF15SIDL_SID0_POSITION                  equ 0005h
RXF15SIDL_SID0_SIZE                      equ 0001h
RXF15SIDL_SID0_LENGTH                    equ 0001h
RXF15SIDL_SID0_MASK                      equ 0020h
RXF15SIDL_SID1_POSN                      equ 0006h
RXF15SIDL_SID1_POSITION                  equ 0006h
RXF15SIDL_SID1_SIZE                      equ 0001h
RXF15SIDL_SID1_LENGTH                    equ 0001h
RXF15SIDL_SID1_MASK                      equ 0040h
RXF15SIDL_SID2_POSN                      equ 0007h
RXF15SIDL_SID2_POSITION                  equ 0007h
RXF15SIDL_SID2_SIZE                      equ 0001h
RXF15SIDL_SID2_LENGTH                    equ 0001h
RXF15SIDL_SID2_MASK                      equ 0080h
RXF15SIDL_EXIDE_POSN                     equ 0003h
RXF15SIDL_EXIDE_POSITION                 equ 0003h
RXF15SIDL_EXIDE_SIZE                     equ 0001h
RXF15SIDL_EXIDE_LENGTH                   equ 0001h
RXF15SIDL_EXIDE_MASK                     equ 0008h
RXF15SIDL_RXF15EID16_POSN                equ 0000h
RXF15SIDL_RXF15EID16_POSITION            equ 0000h
RXF15SIDL_RXF15EID16_SIZE                equ 0001h
RXF15SIDL_RXF15EID16_LENGTH              equ 0001h
RXF15SIDL_RXF15EID16_MASK                equ 0001h
RXF15SIDL_RXF15EID17_POSN                equ 0001h
RXF15SIDL_RXF15EID17_POSITION            equ 0001h
RXF15SIDL_RXF15EID17_SIZE                equ 0001h
RXF15SIDL_RXF15EID17_LENGTH              equ 0001h
RXF15SIDL_RXF15EID17_MASK                equ 0002h
RXF15SIDL_RXF15EXIDEN_POSN               equ 0003h
RXF15SIDL_RXF15EXIDEN_POSITION           equ 0003h
RXF15SIDL_RXF15EXIDEN_SIZE               equ 0001h
RXF15SIDL_RXF15EXIDEN_LENGTH             equ 0001h
RXF15SIDL_RXF15EXIDEN_MASK               equ 0008h
RXF15SIDL_RXF15SID0_POSN                 equ 0005h
RXF15SIDL_RXF15SID0_POSITION             equ 0005h
RXF15SIDL_RXF15SID0_SIZE                 equ 0001h
RXF15SIDL_RXF15SID0_LENGTH               equ 0001h
RXF15SIDL_RXF15SID0_MASK                 equ 0020h
RXF15SIDL_RXF15SID1_POSN                 equ 0006h
RXF15SIDL_RXF15SID1_POSITION             equ 0006h
RXF15SIDL_RXF15SID1_SIZE                 equ 0001h
RXF15SIDL_RXF15SID1_LENGTH               equ 0001h
RXF15SIDL_RXF15SID1_MASK                 equ 0040h
RXF15SIDL_RXF15SID2_POSN                 equ 0007h
RXF15SIDL_RXF15SID2_POSITION             equ 0007h
RXF15SIDL_RXF15SID2_SIZE                 equ 0001h
RXF15SIDL_RXF15SID2_LENGTH               equ 0001h
RXF15SIDL_RXF15SID2_MASK                 equ 0080h

// Register: RXF15EIDH
#define RXF15EIDH RXF15EIDH
RXF15EIDH                                equ 0D92h
// bitfield definitions
RXF15EIDH_EID8_POSN                      equ 0000h
RXF15EIDH_EID8_POSITION                  equ 0000h
RXF15EIDH_EID8_SIZE                      equ 0001h
RXF15EIDH_EID8_LENGTH                    equ 0001h
RXF15EIDH_EID8_MASK                      equ 0001h
RXF15EIDH_EID9_POSN                      equ 0001h
RXF15EIDH_EID9_POSITION                  equ 0001h
RXF15EIDH_EID9_SIZE                      equ 0001h
RXF15EIDH_EID9_LENGTH                    equ 0001h
RXF15EIDH_EID9_MASK                      equ 0002h
RXF15EIDH_EID10_POSN                     equ 0002h
RXF15EIDH_EID10_POSITION                 equ 0002h
RXF15EIDH_EID10_SIZE                     equ 0001h
RXF15EIDH_EID10_LENGTH                   equ 0001h
RXF15EIDH_EID10_MASK                     equ 0004h
RXF15EIDH_EID11_POSN                     equ 0003h
RXF15EIDH_EID11_POSITION                 equ 0003h
RXF15EIDH_EID11_SIZE                     equ 0001h
RXF15EIDH_EID11_LENGTH                   equ 0001h
RXF15EIDH_EID11_MASK                     equ 0008h
RXF15EIDH_EID12_POSN                     equ 0004h
RXF15EIDH_EID12_POSITION                 equ 0004h
RXF15EIDH_EID12_SIZE                     equ 0001h
RXF15EIDH_EID12_LENGTH                   equ 0001h
RXF15EIDH_EID12_MASK                     equ 0010h
RXF15EIDH_EID13_POSN                     equ 0005h
RXF15EIDH_EID13_POSITION                 equ 0005h
RXF15EIDH_EID13_SIZE                     equ 0001h
RXF15EIDH_EID13_LENGTH                   equ 0001h
RXF15EIDH_EID13_MASK                     equ 0020h
RXF15EIDH_EID14_POSN                     equ 0006h
RXF15EIDH_EID14_POSITION                 equ 0006h
RXF15EIDH_EID14_SIZE                     equ 0001h
RXF15EIDH_EID14_LENGTH                   equ 0001h
RXF15EIDH_EID14_MASK                     equ 0040h
RXF15EIDH_EID15_POSN                     equ 0007h
RXF15EIDH_EID15_POSITION                 equ 0007h
RXF15EIDH_EID15_SIZE                     equ 0001h
RXF15EIDH_EID15_LENGTH                   equ 0001h
RXF15EIDH_EID15_MASK                     equ 0080h
RXF15EIDH_RXF15EID8_POSN                 equ 0000h
RXF15EIDH_RXF15EID8_POSITION             equ 0000h
RXF15EIDH_RXF15EID8_SIZE                 equ 0001h
RXF15EIDH_RXF15EID8_LENGTH               equ 0001h
RXF15EIDH_RXF15EID8_MASK                 equ 0001h
RXF15EIDH_RXF15EID9_POSN                 equ 0001h
RXF15EIDH_RXF15EID9_POSITION             equ 0001h
RXF15EIDH_RXF15EID9_SIZE                 equ 0001h
RXF15EIDH_RXF15EID9_LENGTH               equ 0001h
RXF15EIDH_RXF15EID9_MASK                 equ 0002h
RXF15EIDH_RXF15EID10_POSN                equ 0002h
RXF15EIDH_RXF15EID10_POSITION            equ 0002h
RXF15EIDH_RXF15EID10_SIZE                equ 0001h
RXF15EIDH_RXF15EID10_LENGTH              equ 0001h
RXF15EIDH_RXF15EID10_MASK                equ 0004h
RXF15EIDH_RXF15EID11_POSN                equ 0003h
RXF15EIDH_RXF15EID11_POSITION            equ 0003h
RXF15EIDH_RXF15EID11_SIZE                equ 0001h
RXF15EIDH_RXF15EID11_LENGTH              equ 0001h
RXF15EIDH_RXF15EID11_MASK                equ 0008h
RXF15EIDH_RXF15EID12_POSN                equ 0004h
RXF15EIDH_RXF15EID12_POSITION            equ 0004h
RXF15EIDH_RXF15EID12_SIZE                equ 0001h
RXF15EIDH_RXF15EID12_LENGTH              equ 0001h
RXF15EIDH_RXF15EID12_MASK                equ 0010h
RXF15EIDH_RXF15EID13_POSN                equ 0005h
RXF15EIDH_RXF15EID13_POSITION            equ 0005h
RXF15EIDH_RXF15EID13_SIZE                equ 0001h
RXF15EIDH_RXF15EID13_LENGTH              equ 0001h
RXF15EIDH_RXF15EID13_MASK                equ 0020h
RXF15EIDH_RXF15EID14_POSN                equ 0006h
RXF15EIDH_RXF15EID14_POSITION            equ 0006h
RXF15EIDH_RXF15EID14_SIZE                equ 0001h
RXF15EIDH_RXF15EID14_LENGTH              equ 0001h
RXF15EIDH_RXF15EID14_MASK                equ 0040h
RXF15EIDH_RXF15EID15_POSN                equ 0007h
RXF15EIDH_RXF15EID15_POSITION            equ 0007h
RXF15EIDH_RXF15EID15_SIZE                equ 0001h
RXF15EIDH_RXF15EID15_LENGTH              equ 0001h
RXF15EIDH_RXF15EID15_MASK                equ 0080h

// Register: RXF15EIDL
#define RXF15EIDL RXF15EIDL
RXF15EIDL                                equ 0D93h
// bitfield definitions
RXF15EIDL_EID0_POSN                      equ 0000h
RXF15EIDL_EID0_POSITION                  equ 0000h
RXF15EIDL_EID0_SIZE                      equ 0001h
RXF15EIDL_EID0_LENGTH                    equ 0001h
RXF15EIDL_EID0_MASK                      equ 0001h
RXF15EIDL_EID1_POSN                      equ 0001h
RXF15EIDL_EID1_POSITION                  equ 0001h
RXF15EIDL_EID1_SIZE                      equ 0001h
RXF15EIDL_EID1_LENGTH                    equ 0001h
RXF15EIDL_EID1_MASK                      equ 0002h
RXF15EIDL_EID2_POSN                      equ 0002h
RXF15EIDL_EID2_POSITION                  equ 0002h
RXF15EIDL_EID2_SIZE                      equ 0001h
RXF15EIDL_EID2_LENGTH                    equ 0001h
RXF15EIDL_EID2_MASK                      equ 0004h
RXF15EIDL_EID3_POSN                      equ 0003h
RXF15EIDL_EID3_POSITION                  equ 0003h
RXF15EIDL_EID3_SIZE                      equ 0001h
RXF15EIDL_EID3_LENGTH                    equ 0001h
RXF15EIDL_EID3_MASK                      equ 0008h
RXF15EIDL_EID4_POSN                      equ 0004h
RXF15EIDL_EID4_POSITION                  equ 0004h
RXF15EIDL_EID4_SIZE                      equ 0001h
RXF15EIDL_EID4_LENGTH                    equ 0001h
RXF15EIDL_EID4_MASK                      equ 0010h
RXF15EIDL_EID5_POSN                      equ 0005h
RXF15EIDL_EID5_POSITION                  equ 0005h
RXF15EIDL_EID5_SIZE                      equ 0001h
RXF15EIDL_EID5_LENGTH                    equ 0001h
RXF15EIDL_EID5_MASK                      equ 0020h
RXF15EIDL_EID6_POSN                      equ 0006h
RXF15EIDL_EID6_POSITION                  equ 0006h
RXF15EIDL_EID6_SIZE                      equ 0001h
RXF15EIDL_EID6_LENGTH                    equ 0001h
RXF15EIDL_EID6_MASK                      equ 0040h
RXF15EIDL_EID7_POSN                      equ 0007h
RXF15EIDL_EID7_POSITION                  equ 0007h
RXF15EIDL_EID7_SIZE                      equ 0001h
RXF15EIDL_EID7_LENGTH                    equ 0001h
RXF15EIDL_EID7_MASK                      equ 0080h
RXF15EIDL_RXF15EID0_POSN                 equ 0000h
RXF15EIDL_RXF15EID0_POSITION             equ 0000h
RXF15EIDL_RXF15EID0_SIZE                 equ 0001h
RXF15EIDL_RXF15EID0_LENGTH               equ 0001h
RXF15EIDL_RXF15EID0_MASK                 equ 0001h
RXF15EIDL_RXF15EID1_POSN                 equ 0001h
RXF15EIDL_RXF15EID1_POSITION             equ 0001h
RXF15EIDL_RXF15EID1_SIZE                 equ 0001h
RXF15EIDL_RXF15EID1_LENGTH               equ 0001h
RXF15EIDL_RXF15EID1_MASK                 equ 0002h
RXF15EIDL_RXF15EID2_POSN                 equ 0002h
RXF15EIDL_RXF15EID2_POSITION             equ 0002h
RXF15EIDL_RXF15EID2_SIZE                 equ 0001h
RXF15EIDL_RXF15EID2_LENGTH               equ 0001h
RXF15EIDL_RXF15EID2_MASK                 equ 0004h
RXF15EIDL_RXF15EID3_POSN                 equ 0003h
RXF15EIDL_RXF15EID3_POSITION             equ 0003h
RXF15EIDL_RXF15EID3_SIZE                 equ 0001h
RXF15EIDL_RXF15EID3_LENGTH               equ 0001h
RXF15EIDL_RXF15EID3_MASK                 equ 0008h
RXF15EIDL_RXF15EID4_POSN                 equ 0004h
RXF15EIDL_RXF15EID4_POSITION             equ 0004h
RXF15EIDL_RXF15EID4_SIZE                 equ 0001h
RXF15EIDL_RXF15EID4_LENGTH               equ 0001h
RXF15EIDL_RXF15EID4_MASK                 equ 0010h
RXF15EIDL_RXF15EID5_POSN                 equ 0005h
RXF15EIDL_RXF15EID5_POSITION             equ 0005h
RXF15EIDL_RXF15EID5_SIZE                 equ 0001h
RXF15EIDL_RXF15EID5_LENGTH               equ 0001h
RXF15EIDL_RXF15EID5_MASK                 equ 0020h
RXF15EIDL_RXF15EID6_POSN                 equ 0006h
RXF15EIDL_RXF15EID6_POSITION             equ 0006h
RXF15EIDL_RXF15EID6_SIZE                 equ 0001h
RXF15EIDL_RXF15EID6_LENGTH               equ 0001h
RXF15EIDL_RXF15EID6_MASK                 equ 0040h
RXF15EIDL_RXF15EID7_POSN                 equ 0007h
RXF15EIDL_RXF15EID7_POSITION             equ 0007h
RXF15EIDL_RXF15EID7_SIZE                 equ 0001h
RXF15EIDL_RXF15EID7_LENGTH               equ 0001h
RXF15EIDL_RXF15EID7_MASK                 equ 0080h

// Register: RXFCON0
#define RXFCON0 RXFCON0
RXFCON0                                  equ 0DD4h
// bitfield definitions
RXFCON0_RXF0EN_POSN                      equ 0000h
RXFCON0_RXF0EN_POSITION                  equ 0000h
RXFCON0_RXF0EN_SIZE                      equ 0001h
RXFCON0_RXF0EN_LENGTH                    equ 0001h
RXFCON0_RXF0EN_MASK                      equ 0001h
RXFCON0_RXF1EN_POSN                      equ 0001h
RXFCON0_RXF1EN_POSITION                  equ 0001h
RXFCON0_RXF1EN_SIZE                      equ 0001h
RXFCON0_RXF1EN_LENGTH                    equ 0001h
RXFCON0_RXF1EN_MASK                      equ 0002h
RXFCON0_RXF2EN_POSN                      equ 0002h
RXFCON0_RXF2EN_POSITION                  equ 0002h
RXFCON0_RXF2EN_SIZE                      equ 0001h
RXFCON0_RXF2EN_LENGTH                    equ 0001h
RXFCON0_RXF2EN_MASK                      equ 0004h
RXFCON0_RXF3EN_POSN                      equ 0003h
RXFCON0_RXF3EN_POSITION                  equ 0003h
RXFCON0_RXF3EN_SIZE                      equ 0001h
RXFCON0_RXF3EN_LENGTH                    equ 0001h
RXFCON0_RXF3EN_MASK                      equ 0008h
RXFCON0_RXF4EN_POSN                      equ 0004h
RXFCON0_RXF4EN_POSITION                  equ 0004h
RXFCON0_RXF4EN_SIZE                      equ 0001h
RXFCON0_RXF4EN_LENGTH                    equ 0001h
RXFCON0_RXF4EN_MASK                      equ 0010h
RXFCON0_RXF5EN_POSN                      equ 0005h
RXFCON0_RXF5EN_POSITION                  equ 0005h
RXFCON0_RXF5EN_SIZE                      equ 0001h
RXFCON0_RXF5EN_LENGTH                    equ 0001h
RXFCON0_RXF5EN_MASK                      equ 0020h
RXFCON0_RXF6EN_POSN                      equ 0006h
RXFCON0_RXF6EN_POSITION                  equ 0006h
RXFCON0_RXF6EN_SIZE                      equ 0001h
RXFCON0_RXF6EN_LENGTH                    equ 0001h
RXFCON0_RXF6EN_MASK                      equ 0040h
RXFCON0_RXF7EN_POSN                      equ 0007h
RXFCON0_RXF7EN_POSITION                  equ 0007h
RXFCON0_RXF7EN_SIZE                      equ 0001h
RXFCON0_RXF7EN_LENGTH                    equ 0001h
RXFCON0_RXF7EN_MASK                      equ 0080h

