GopalSaraf/Practicals/PSDL/include/proc/pic18lf4685.inc
// Register: CANSTAT_RO8
#define CANSTAT_RO8 CANSTAT_RO8
CANSTAT_RO8                              equ 0E3Eh
// bitfield definitions
CANSTAT_RO8_EICODE0_POSN                 equ 0000h
CANSTAT_RO8_EICODE0_POSITION             equ 0000h
CANSTAT_RO8_EICODE0_SIZE                 equ 0001h
CANSTAT_RO8_EICODE0_LENGTH               equ 0001h
CANSTAT_RO8_EICODE0_MASK                 equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_POSN          equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_POSITION      equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_SIZE          equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_LENGTH        equ 0001h
CANSTAT_RO8_EICODE1_ICODE0_MASK          equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_POSN          equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_POSITION      equ 0002h
CANSTAT_RO8_EICODE2_ICODE1_SIZE          equ 0001h
CANSTAT_RO8_EICODE2_ICODE1_LENGTH        equ 0001h
CANSTAT_RO8_EICODE2_ICODE1_MASK          equ 0004h
CANSTAT_RO8_EICODE3_ICODE2_POSN          equ 0003h
CANSTAT_RO8_EICODE3_ICODE2_POSITION      equ 0003h
CANSTAT_RO8_EICODE3_ICODE2_SIZE          equ 0001h
CANSTAT_RO8_EICODE3_ICODE2_LENGTH        equ 0001h
CANSTAT_RO8_EICODE3_ICODE2_MASK          equ 0008h
CANSTAT_RO8_EICODE4_POSN                 equ 0004h
CANSTAT_RO8_EICODE4_POSITION             equ 0004h
CANSTAT_RO8_EICODE4_SIZE                 equ 0001h
CANSTAT_RO8_EICODE4_LENGTH               equ 0001h
CANSTAT_RO8_EICODE4_MASK                 equ 0010h
CANSTAT_RO8_OPMODE0_POSN                 equ 0005h
CANSTAT_RO8_OPMODE0_POSITION             equ 0005h
CANSTAT_RO8_OPMODE0_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE0_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE0_MASK                 equ 0020h
CANSTAT_RO8_OPMODE1_POSN                 equ 0006h
CANSTAT_RO8_OPMODE1_POSITION             equ 0006h
CANSTAT_RO8_OPMODE1_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE1_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE1_MASK                 equ 0040h
CANSTAT_RO8_OPMODE2_POSN                 equ 0007h
CANSTAT_RO8_OPMODE2_POSITION             equ 0007h
CANSTAT_RO8_OPMODE2_SIZE                 equ 0001h
CANSTAT_RO8_OPMODE2_LENGTH               equ 0001h
CANSTAT_RO8_OPMODE2_MASK                 equ 0080h
CANSTAT_RO8_ICODE0_POSN                  equ 0000h
CANSTAT_RO8_ICODE0_POSITION              equ 0000h
CANSTAT_RO8_ICODE0_SIZE                  equ 0001h
CANSTAT_RO8_ICODE0_LENGTH                equ 0001h
CANSTAT_RO8_ICODE0_MASK                  equ 0001h
CANSTAT_RO8_ICODE1_POSN                  equ 0001h
CANSTAT_RO8_ICODE1_POSITION              equ 0001h
CANSTAT_RO8_ICODE1_SIZE                  equ 0001h
CANSTAT_RO8_ICODE1_LENGTH                equ 0001h
CANSTAT_RO8_ICODE1_MASK                  equ 0002h
CANSTAT_RO8_ICODE2_POSN                  equ 0002h
CANSTAT_RO8_ICODE2_POSITION              equ 0002h
CANSTAT_RO8_ICODE2_SIZE                  equ 0001h
CANSTAT_RO8_ICODE2_LENGTH                equ 0001h
CANSTAT_RO8_ICODE2_MASK                  equ 0004h
CANSTAT_RO8_ICODE3_POSN                  equ 0003h
CANSTAT_RO8_ICODE3_POSITION              equ 0003h
CANSTAT_RO8_ICODE3_SIZE                  equ 0001h
CANSTAT_RO8_ICODE3_LENGTH                equ 0001h
CANSTAT_RO8_ICODE3_MASK                  equ 0008h
CANSTAT_RO8_ICODE4_POSN                  equ 0004h
CANSTAT_RO8_ICODE4_POSITION              equ 0004h
CANSTAT_RO8_ICODE4_SIZE                  equ 0001h
CANSTAT_RO8_ICODE4_LENGTH                equ 0001h
CANSTAT_RO8_ICODE4_MASK                  equ 0010h

// Register: CANCON_RO8
#define CANCON_RO8 CANCON_RO8
CANCON_RO8                               equ 0E3Fh
// bitfield definitions
CANCON_RO8_FP0_POSN                      equ 0000h
CANCON_RO8_FP0_POSITION                  equ 0000h
CANCON_RO8_FP0_SIZE                      equ 0001h
CANCON_RO8_FP0_LENGTH                    equ 0001h
CANCON_RO8_FP0_MASK                      equ 0001h
CANCON_RO8_WIN0_FP1_POSN                 equ 0001h
CANCON_RO8_WIN0_FP1_POSITION             equ 0001h
CANCON_RO8_WIN0_FP1_SIZE                 equ 0001h
CANCON_RO8_WIN0_FP1_LENGTH               equ 0001h
CANCON_RO8_WIN0_FP1_MASK                 equ 0002h
CANCON_RO8_WIN1_FP2_POSN                 equ 0002h
CANCON_RO8_WIN1_FP2_POSITION             equ 0002h
CANCON_RO8_WIN1_FP2_SIZE                 equ 0001h
CANCON_RO8_WIN1_FP2_LENGTH               equ 0001h
CANCON_RO8_WIN1_FP2_MASK                 equ 0004h
CANCON_RO8_WIN2_FP3_POSN                 equ 0003h
CANCON_RO8_WIN2_FP3_POSITION             equ 0003h
CANCON_RO8_WIN2_FP3_SIZE                 equ 0001h
CANCON_RO8_WIN2_FP3_LENGTH               equ 0001h
CANCON_RO8_WIN2_FP3_MASK                 equ 0008h
CANCON_RO8_ABAT_POSN                     equ 0004h
CANCON_RO8_ABAT_POSITION                 equ 0004h
CANCON_RO8_ABAT_SIZE                     equ 0001h
CANCON_RO8_ABAT_LENGTH                   equ 0001h
CANCON_RO8_ABAT_MASK                     equ 0010h
CANCON_RO8_REQOP0_POSN                   equ 0005h
CANCON_RO8_REQOP0_POSITION               equ 0005h
CANCON_RO8_REQOP0_SIZE                   equ 0001h
CANCON_RO8_REQOP0_LENGTH                 equ 0001h
CANCON_RO8_REQOP0_MASK                   equ 0020h
CANCON_RO8_REQOP1_POSN                   equ 0006h
CANCON_RO8_REQOP1_POSITION               equ 0006h
CANCON_RO8_REQOP1_SIZE                   equ 0001h
CANCON_RO8_REQOP1_LENGTH                 equ 0001h
CANCON_RO8_REQOP1_MASK                   equ 0040h
CANCON_RO8_REQOP2_POSN                   equ 0007h
CANCON_RO8_REQOP2_POSITION               equ 0007h
CANCON_RO8_REQOP2_SIZE                   equ 0001h
CANCON_RO8_REQOP2_LENGTH                 equ 0001h
CANCON_RO8_REQOP2_MASK                   equ 0080h
CANCON_RO8_WIN0_POSN                     equ 0001h
CANCON_RO8_WIN0_POSITION                 equ 0001h
CANCON_RO8_WIN0_SIZE                     equ 0001h
CANCON_RO8_WIN0_LENGTH                   equ 0001h
CANCON_RO8_WIN0_MASK                     equ 0002h
CANCON_RO8_WIN1_POSN                     equ 0002h
CANCON_RO8_WIN1_POSITION                 equ 0002h
CANCON_RO8_WIN1_SIZE                     equ 0001h
CANCON_RO8_WIN1_LENGTH                   equ 0001h
CANCON_RO8_WIN1_MASK                     equ 0004h
CANCON_RO8_WIN2_POSN                     equ 0003h
CANCON_RO8_WIN2_POSITION                 equ 0003h
CANCON_RO8_WIN2_SIZE                     equ 0001h
CANCON_RO8_WIN2_LENGTH                   equ 0001h
CANCON_RO8_WIN2_MASK                     equ 0008h

