GopalSaraf/Practicals/PSDL/include/proc/pic18lf4685.inc
// Register: B3SIDH
#define B3SIDH B3SIDH
B3SIDH                                   equ 0E51h
// bitfield definitions
B3SIDH_SID3_POSN                         equ 0000h
B3SIDH_SID3_POSITION                     equ 0000h
B3SIDH_SID3_SIZE                         equ 0001h
B3SIDH_SID3_LENGTH                       equ 0001h
B3SIDH_SID3_MASK                         equ 0001h
B3SIDH_SID4_POSN                         equ 0001h
B3SIDH_SID4_POSITION                     equ 0001h
B3SIDH_SID4_SIZE                         equ 0001h
B3SIDH_SID4_LENGTH                       equ 0001h
B3SIDH_SID4_MASK                         equ 0002h
B3SIDH_SID5_POSN                         equ 0002h
B3SIDH_SID5_POSITION                     equ 0002h
B3SIDH_SID5_SIZE                         equ 0001h
B3SIDH_SID5_LENGTH                       equ 0001h
B3SIDH_SID5_MASK                         equ 0004h
B3SIDH_SID6_POSN                         equ 0003h
B3SIDH_SID6_POSITION                     equ 0003h
B3SIDH_SID6_SIZE                         equ 0001h
B3SIDH_SID6_LENGTH                       equ 0001h
B3SIDH_SID6_MASK                         equ 0008h
B3SIDH_SID7_POSN                         equ 0004h
B3SIDH_SID7_POSITION                     equ 0004h
B3SIDH_SID7_SIZE                         equ 0001h
B3SIDH_SID7_LENGTH                       equ 0001h
B3SIDH_SID7_MASK                         equ 0010h
B3SIDH_SID8_POSN                         equ 0005h
B3SIDH_SID8_POSITION                     equ 0005h
B3SIDH_SID8_SIZE                         equ 0001h
B3SIDH_SID8_LENGTH                       equ 0001h
B3SIDH_SID8_MASK                         equ 0020h
B3SIDH_SID9_POSN                         equ 0006h
B3SIDH_SID9_POSITION                     equ 0006h
B3SIDH_SID9_SIZE                         equ 0001h
B3SIDH_SID9_LENGTH                       equ 0001h
B3SIDH_SID9_MASK                         equ 0040h
B3SIDH_SID10_POSN                        equ 0007h
B3SIDH_SID10_POSITION                    equ 0007h
B3SIDH_SID10_SIZE                        equ 0001h
B3SIDH_SID10_LENGTH                      equ 0001h
B3SIDH_SID10_MASK                        equ 0080h
B3SIDH_B3SID3_POSN                       equ 0000h
B3SIDH_B3SID3_POSITION                   equ 0000h
B3SIDH_B3SID3_SIZE                       equ 0001h
B3SIDH_B3SID3_LENGTH                     equ 0001h
B3SIDH_B3SID3_MASK                       equ 0001h
B3SIDH_B3SID4_POSN                       equ 0001h
B3SIDH_B3SID4_POSITION                   equ 0001h
B3SIDH_B3SID4_SIZE                       equ 0001h
B3SIDH_B3SID4_LENGTH                     equ 0001h
B3SIDH_B3SID4_MASK                       equ 0002h
B3SIDH_B3SID5_POSN                       equ 0002h
B3SIDH_B3SID5_POSITION                   equ 0002h
B3SIDH_B3SID5_SIZE                       equ 0001h
B3SIDH_B3SID5_LENGTH                     equ 0001h
B3SIDH_B3SID5_MASK                       equ 0004h
B3SIDH_B3SID6_POSN                       equ 0003h
B3SIDH_B3SID6_POSITION                   equ 0003h
B3SIDH_B3SID6_SIZE                       equ 0001h
B3SIDH_B3SID6_LENGTH                     equ 0001h
B3SIDH_B3SID6_MASK                       equ 0008h
B3SIDH_B3SID7_POSN                       equ 0004h
B3SIDH_B3SID7_POSITION                   equ 0004h
B3SIDH_B3SID7_SIZE                       equ 0001h
B3SIDH_B3SID7_LENGTH                     equ 0001h
B3SIDH_B3SID7_MASK                       equ 0010h
B3SIDH_B3SID8_POSN                       equ 0005h
B3SIDH_B3SID8_POSITION                   equ 0005h
B3SIDH_B3SID8_SIZE                       equ 0001h
B3SIDH_B3SID8_LENGTH                     equ 0001h
B3SIDH_B3SID8_MASK                       equ 0020h
B3SIDH_B3SID9_POSN                       equ 0006h
B3SIDH_B3SID9_POSITION                   equ 0006h
B3SIDH_B3SID9_SIZE                       equ 0001h
B3SIDH_B3SID9_LENGTH                     equ 0001h
B3SIDH_B3SID9_MASK                       equ 0040h
B3SIDH_B3SID10_POSN                      equ 0007h
B3SIDH_B3SID10_POSITION                  equ 0007h
B3SIDH_B3SID10_SIZE                      equ 0001h
B3SIDH_B3SID10_LENGTH                    equ 0001h
B3SIDH_B3SID10_MASK                      equ 0080h

// Register: B3SIDL
#define B3SIDL B3SIDL
B3SIDL                                   equ 0E52h
// bitfield definitions
B3SIDL_EID16_POSN                        equ 0000h
B3SIDL_EID16_POSITION                    equ 0000h
B3SIDL_EID16_SIZE                        equ 0001h
B3SIDL_EID16_LENGTH                      equ 0001h
B3SIDL_EID16_MASK                        equ 0001h
B3SIDL_EID17_POSN                        equ 0001h
B3SIDL_EID17_POSITION                    equ 0001h
B3SIDL_EID17_SIZE                        equ 0001h
B3SIDL_EID17_LENGTH                      equ 0001h
B3SIDL_EID17_MASK                        equ 0002h
B3SIDL_EXIDE_POSN                        equ 0003h
B3SIDL_EXIDE_POSITION                    equ 0003h
B3SIDL_EXIDE_SIZE                        equ 0001h
B3SIDL_EXIDE_LENGTH                      equ 0001h
B3SIDL_EXIDE_MASK                        equ 0008h
B3SIDL_SRR_POSN                          equ 0004h
B3SIDL_SRR_POSITION                      equ 0004h
B3SIDL_SRR_SIZE                          equ 0001h
B3SIDL_SRR_LENGTH                        equ 0001h
B3SIDL_SRR_MASK                          equ 0010h
B3SIDL_SID0_POSN                         equ 0005h
B3SIDL_SID0_POSITION                     equ 0005h
B3SIDL_SID0_SIZE                         equ 0001h
B3SIDL_SID0_LENGTH                       equ 0001h
B3SIDL_SID0_MASK                         equ 0020h
B3SIDL_SID1_POSN                         equ 0006h
B3SIDL_SID1_POSITION                     equ 0006h
B3SIDL_SID1_SIZE                         equ 0001h
B3SIDL_SID1_LENGTH                       equ 0001h
B3SIDL_SID1_MASK                         equ 0040h
B3SIDL_SID2_POSN                         equ 0007h
B3SIDL_SID2_POSITION                     equ 0007h
B3SIDL_SID2_SIZE                         equ 0001h
B3SIDL_SID2_LENGTH                       equ 0001h
B3SIDL_SID2_MASK                         equ 0080h
B3SIDL_EXID_POSN                         equ 0003h
B3SIDL_EXID_POSITION                     equ 0003h
B3SIDL_EXID_SIZE                         equ 0001h
B3SIDL_EXID_LENGTH                       equ 0001h
B3SIDL_EXID_MASK                         equ 0008h
B3SIDL_B3EID16_POSN                      equ 0000h
B3SIDL_B3EID16_POSITION                  equ 0000h
B3SIDL_B3EID16_SIZE                      equ 0001h
B3SIDL_B3EID16_LENGTH                    equ 0001h
B3SIDL_B3EID16_MASK                      equ 0001h
B3SIDL_B3EID17_POSN                      equ 0001h
B3SIDL_B3EID17_POSITION                  equ 0001h
B3SIDL_B3EID17_SIZE                      equ 0001h
B3SIDL_B3EID17_LENGTH                    equ 0001h
B3SIDL_B3EID17_MASK                      equ 0002h
B3SIDL_B3EXID_POSN                       equ 0003h
B3SIDL_B3EXID_POSITION                   equ 0003h
B3SIDL_B3EXID_SIZE                       equ 0001h
B3SIDL_B3EXID_LENGTH                     equ 0001h
B3SIDL_B3EXID_MASK                       equ 0008h
B3SIDL_B3SRR_POSN                        equ 0004h
B3SIDL_B3SRR_POSITION                    equ 0004h
B3SIDL_B3SRR_SIZE                        equ 0001h
B3SIDL_B3SRR_LENGTH                      equ 0001h
B3SIDL_B3SRR_MASK                        equ 0010h
B3SIDL_B3SID0_POSN                       equ 0005h
B3SIDL_B3SID0_POSITION                   equ 0005h
B3SIDL_B3SID0_SIZE                       equ 0001h
B3SIDL_B3SID0_LENGTH                     equ 0001h
B3SIDL_B3SID0_MASK                       equ 0020h
B3SIDL_B3SID1_POSN                       equ 0006h
B3SIDL_B3SID1_POSITION                   equ 0006h
B3SIDL_B3SID1_SIZE                       equ 0001h
B3SIDL_B3SID1_LENGTH                     equ 0001h
B3SIDL_B3SID1_MASK                       equ 0040h
B3SIDL_B3SID2_POSN                       equ 0007h
B3SIDL_B3SID2_POSITION                   equ 0007h
B3SIDL_B3SID2_SIZE                       equ 0001h
B3SIDL_B3SID2_LENGTH                     equ 0001h
B3SIDL_B3SID2_MASK                       equ 0080h
B3SIDL_B3EXIDE_POSN                      equ 0003h
B3SIDL_B3EXIDE_POSITION                  equ 0003h
B3SIDL_B3EXIDE_SIZE                      equ 0001h
B3SIDL_B3EXIDE_LENGTH                    equ 0001h
B3SIDL_B3EXIDE_MASK                      equ 0008h

// Register: B3EIDH
#define B3EIDH B3EIDH
B3EIDH                                   equ 0E53h
// bitfield definitions
B3EIDH_EID8_POSN                         equ 0000h
B3EIDH_EID8_POSITION                     equ 0000h
B3EIDH_EID8_SIZE                         equ 0001h
B3EIDH_EID8_LENGTH                       equ 0001h
B3EIDH_EID8_MASK                         equ 0001h
B3EIDH_EID9_POSN                         equ 0001h
B3EIDH_EID9_POSITION                     equ 0001h
B3EIDH_EID9_SIZE                         equ 0001h
B3EIDH_EID9_LENGTH                       equ 0001h
B3EIDH_EID9_MASK                         equ 0002h
B3EIDH_EID10_POSN                        equ 0002h
B3EIDH_EID10_POSITION                    equ 0002h
B3EIDH_EID10_SIZE                        equ 0001h
B3EIDH_EID10_LENGTH                      equ 0001h
B3EIDH_EID10_MASK                        equ 0004h
B3EIDH_EID11_POSN                        equ 0003h
B3EIDH_EID11_POSITION                    equ 0003h
B3EIDH_EID11_SIZE                        equ 0001h
B3EIDH_EID11_LENGTH                      equ 0001h
B3EIDH_EID11_MASK                        equ 0008h
B3EIDH_EID12_POSN                        equ 0004h
B3EIDH_EID12_POSITION                    equ 0004h
B3EIDH_EID12_SIZE                        equ 0001h
B3EIDH_EID12_LENGTH                      equ 0001h
B3EIDH_EID12_MASK                        equ 0010h
B3EIDH_EID13_POSN                        equ 0005h
B3EIDH_EID13_POSITION                    equ 0005h
B3EIDH_EID13_SIZE                        equ 0001h
B3EIDH_EID13_LENGTH                      equ 0001h
B3EIDH_EID13_MASK                        equ 0020h
B3EIDH_EID14_POSN                        equ 0006h
B3EIDH_EID14_POSITION                    equ 0006h
B3EIDH_EID14_SIZE                        equ 0001h
B3EIDH_EID14_LENGTH                      equ 0001h
B3EIDH_EID14_MASK                        equ 0040h
B3EIDH_EID15_POSN                        equ 0007h
B3EIDH_EID15_POSITION                    equ 0007h
B3EIDH_EID15_SIZE                        equ 0001h
B3EIDH_EID15_LENGTH                      equ 0001h
B3EIDH_EID15_MASK                        equ 0080h
B3EIDH_B3EID8_POSN                       equ 0000h
B3EIDH_B3EID8_POSITION                   equ 0000h
B3EIDH_B3EID8_SIZE                       equ 0001h
B3EIDH_B3EID8_LENGTH                     equ 0001h
B3EIDH_B3EID8_MASK                       equ 0001h
B3EIDH_B3EID9_POSN                       equ 0001h
B3EIDH_B3EID9_POSITION                   equ 0001h
B3EIDH_B3EID9_SIZE                       equ 0001h
B3EIDH_B3EID9_LENGTH                     equ 0001h
B3EIDH_B3EID9_MASK                       equ 0002h
B3EIDH_B3EID10_POSN                      equ 0002h
B3EIDH_B3EID10_POSITION                  equ 0002h
B3EIDH_B3EID10_SIZE                      equ 0001h
B3EIDH_B3EID10_LENGTH                    equ 0001h
B3EIDH_B3EID10_MASK                      equ 0004h
B3EIDH_B3EID11_POSN                      equ 0003h
B3EIDH_B3EID11_POSITION                  equ 0003h
B3EIDH_B3EID11_SIZE                      equ 0001h
B3EIDH_B3EID11_LENGTH                    equ 0001h
B3EIDH_B3EID11_MASK                      equ 0008h
B3EIDH_B3EID12_POSN                      equ 0004h
B3EIDH_B3EID12_POSITION                  equ 0004h
B3EIDH_B3EID12_SIZE                      equ 0001h
B3EIDH_B3EID12_LENGTH                    equ 0001h
B3EIDH_B3EID12_MASK                      equ 0010h
B3EIDH_B3EID13_POSN                      equ 0005h
B3EIDH_B3EID13_POSITION                  equ 0005h
B3EIDH_B3EID13_SIZE                      equ 0001h
B3EIDH_B3EID13_LENGTH                    equ 0001h
B3EIDH_B3EID13_MASK                      equ 0020h
B3EIDH_B3EID14_POSN                      equ 0006h
B3EIDH_B3EID14_POSITION                  equ 0006h
B3EIDH_B3EID14_SIZE                      equ 0001h
B3EIDH_B3EID14_LENGTH                    equ 0001h
B3EIDH_B3EID14_MASK                      equ 0040h
B3EIDH_B3EID15_POSN                      equ 0007h
B3EIDH_B3EID15_POSITION                  equ 0007h
B3EIDH_B3EID15_SIZE                      equ 0001h
B3EIDH_B3EID15_LENGTH                    equ 0001h
B3EIDH_B3EID15_MASK                      equ 0080h

// Register: B3EIDL
#define B3EIDL B3EIDL
B3EIDL                                   equ 0E54h
// bitfield definitions
B3EIDL_EID0_POSN                         equ 0000h
B3EIDL_EID0_POSITION                     equ 0000h
B3EIDL_EID0_SIZE                         equ 0001h
B3EIDL_EID0_LENGTH                       equ 0001h
B3EIDL_EID0_MASK                         equ 0001h
B3EIDL_EID1_POSN                         equ 0001h
B3EIDL_EID1_POSITION                     equ 0001h
B3EIDL_EID1_SIZE                         equ 0001h
B3EIDL_EID1_LENGTH                       equ 0001h
B3EIDL_EID1_MASK                         equ 0002h
B3EIDL_EID2_POSN                         equ 0002h
B3EIDL_EID2_POSITION                     equ 0002h
B3EIDL_EID2_SIZE                         equ 0001h
B3EIDL_EID2_LENGTH                       equ 0001h
B3EIDL_EID2_MASK                         equ 0004h
B3EIDL_EID3_POSN                         equ 0003h
B3EIDL_EID3_POSITION                     equ 0003h
B3EIDL_EID3_SIZE                         equ 0001h
B3EIDL_EID3_LENGTH                       equ 0001h
B3EIDL_EID3_MASK                         equ 0008h
B3EIDL_EID4_POSN                         equ 0004h
B3EIDL_EID4_POSITION                     equ 0004h
B3EIDL_EID4_SIZE                         equ 0001h
B3EIDL_EID4_LENGTH                       equ 0001h
B3EIDL_EID4_MASK                         equ 0010h
B3EIDL_EID5_POSN                         equ 0005h
B3EIDL_EID5_POSITION                     equ 0005h
B3EIDL_EID5_SIZE                         equ 0001h
B3EIDL_EID5_LENGTH                       equ 0001h
B3EIDL_EID5_MASK                         equ 0020h
B3EIDL_EID6_POSN                         equ 0006h
B3EIDL_EID6_POSITION                     equ 0006h
B3EIDL_EID6_SIZE                         equ 0001h
B3EIDL_EID6_LENGTH                       equ 0001h
B3EIDL_EID6_MASK                         equ 0040h
B3EIDL_EID7_POSN                         equ 0007h
B3EIDL_EID7_POSITION                     equ 0007h
B3EIDL_EID7_SIZE                         equ 0001h
B3EIDL_EID7_LENGTH                       equ 0001h
B3EIDL_EID7_MASK                         equ 0080h
B3EIDL_B3EID0_POSN                       equ 0000h
B3EIDL_B3EID0_POSITION                   equ 0000h
B3EIDL_B3EID0_SIZE                       equ 0001h
B3EIDL_B3EID0_LENGTH                     equ 0001h
B3EIDL_B3EID0_MASK                       equ 0001h
B3EIDL_B3EID1_POSN                       equ 0001h
B3EIDL_B3EID1_POSITION                   equ 0001h
B3EIDL_B3EID1_SIZE                       equ 0001h
B3EIDL_B3EID1_LENGTH                     equ 0001h
B3EIDL_B3EID1_MASK                       equ 0002h
B3EIDL_B3EID2_POSN                       equ 0002h
B3EIDL_B3EID2_POSITION                   equ 0002h
B3EIDL_B3EID2_SIZE                       equ 0001h
B3EIDL_B3EID2_LENGTH                     equ 0001h
B3EIDL_B3EID2_MASK                       equ 0004h
B3EIDL_B3EID3_POSN                       equ 0003h
B3EIDL_B3EID3_POSITION                   equ 0003h
B3EIDL_B3EID3_SIZE                       equ 0001h
B3EIDL_B3EID3_LENGTH                     equ 0001h
B3EIDL_B3EID3_MASK                       equ 0008h
B3EIDL_B3EID4_POSN                       equ 0004h
B3EIDL_B3EID4_POSITION                   equ 0004h
B3EIDL_B3EID4_SIZE                       equ 0001h
B3EIDL_B3EID4_LENGTH                     equ 0001h
B3EIDL_B3EID4_MASK                       equ 0010h
B3EIDL_B3EID5_POSN                       equ 0005h
B3EIDL_B3EID5_POSITION                   equ 0005h
B3EIDL_B3EID5_SIZE                       equ 0001h
B3EIDL_B3EID5_LENGTH                     equ 0001h
B3EIDL_B3EID5_MASK                       equ 0020h
B3EIDL_B3EID6_POSN                       equ 0006h
B3EIDL_B3EID6_POSITION                   equ 0006h
B3EIDL_B3EID6_SIZE                       equ 0001h
B3EIDL_B3EID6_LENGTH                     equ 0001h
B3EIDL_B3EID6_MASK                       equ 0040h
B3EIDL_B3EID7_POSN                       equ 0007h
B3EIDL_B3EID7_POSITION                   equ 0007h
B3EIDL_B3EID7_SIZE                       equ 0001h
B3EIDL_B3EID7_LENGTH                     equ 0001h
B3EIDL_B3EID7_MASK                       equ 0080h

// Register: B3DLC
#define B3DLC B3DLC
B3DLC                                    equ 0E55h
// bitfield definitions
B3DLC_DLC0_POSN                          equ 0000h
B3DLC_DLC0_POSITION                      equ 0000h
B3DLC_DLC0_SIZE                          equ 0001h
B3DLC_DLC0_LENGTH                        equ 0001h
B3DLC_DLC0_MASK                          equ 0001h
B3DLC_DLC1_POSN                          equ 0001h
B3DLC_DLC1_POSITION                      equ 0001h
B3DLC_DLC1_SIZE                          equ 0001h
B3DLC_DLC1_LENGTH                        equ 0001h
B3DLC_DLC1_MASK                          equ 0002h
B3DLC_DLC2_POSN                          equ 0002h
B3DLC_DLC2_POSITION                      equ 0002h
B3DLC_DLC2_SIZE                          equ 0001h
B3DLC_DLC2_LENGTH                        equ 0001h
B3DLC_DLC2_MASK                          equ 0004h
B3DLC_DLC3_POSN                          equ 0003h
B3DLC_DLC3_POSITION                      equ 0003h
B3DLC_DLC3_SIZE                          equ 0001h
B3DLC_DLC3_LENGTH                        equ 0001h
B3DLC_DLC3_MASK                          equ 0008h
B3DLC_RB0_POSN                           equ 0004h
B3DLC_RB0_POSITION                       equ 0004h
B3DLC_RB0_SIZE                           equ 0001h
B3DLC_RB0_LENGTH                         equ 0001h
B3DLC_RB0_MASK                           equ 0010h
B3DLC_RB1_POSN                           equ 0005h
B3DLC_RB1_POSITION                       equ 0005h
B3DLC_RB1_SIZE                           equ 0001h
B3DLC_RB1_LENGTH                         equ 0001h
B3DLC_RB1_MASK                           equ 0020h
B3DLC_RXRTR_TXRTR_POSN                   equ 0006h
B3DLC_RXRTR_TXRTR_POSITION               equ 0006h
B3DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B3DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B3DLC_RXRTR_TXRTR_MASK                   equ 0040h
B3DLC_RESRB0_POSN                        equ 0004h
B3DLC_RESRB0_POSITION                    equ 0004h
B3DLC_RESRB0_SIZE                        equ 0001h
B3DLC_RESRB0_LENGTH                      equ 0001h
B3DLC_RESRB0_MASK                        equ 0010h
B3DLC_RESRB1_POSN                        equ 0005h
B3DLC_RESRB1_POSITION                    equ 0005h
B3DLC_RESRB1_SIZE                        equ 0001h
B3DLC_RESRB1_LENGTH                      equ 0001h
B3DLC_RESRB1_MASK                        equ 0020h
B3DLC_TXRTR_POSN                         equ 0006h
B3DLC_TXRTR_POSITION                     equ 0006h
B3DLC_TXRTR_SIZE                         equ 0001h
B3DLC_TXRTR_LENGTH                       equ 0001h
B3DLC_TXRTR_MASK                         equ 0040h
B3DLC_RXRTR_POSN                         equ 0006h
B3DLC_RXRTR_POSITION                     equ 0006h
B3DLC_RXRTR_SIZE                         equ 0001h
B3DLC_RXRTR_LENGTH                       equ 0001h
B3DLC_RXRTR_MASK                         equ 0040h
B3DLC_B3DLC0_POSN                        equ 0000h
B3DLC_B3DLC0_POSITION                    equ 0000h
B3DLC_B3DLC0_SIZE                        equ 0001h
B3DLC_B3DLC0_LENGTH                      equ 0001h
B3DLC_B3DLC0_MASK                        equ 0001h
B3DLC_B3DLC1_POSN                        equ 0001h
B3DLC_B3DLC1_POSITION                    equ 0001h
B3DLC_B3DLC1_SIZE                        equ 0001h
B3DLC_B3DLC1_LENGTH                      equ 0001h
B3DLC_B3DLC1_MASK                        equ 0002h
B3DLC_B3DLC2_POSN                        equ 0002h
B3DLC_B3DLC2_POSITION                    equ 0002h
B3DLC_B3DLC2_SIZE                        equ 0001h
B3DLC_B3DLC2_LENGTH                      equ 0001h
B3DLC_B3DLC2_MASK                        equ 0004h
B3DLC_B3DLC3_POSN                        equ 0003h
B3DLC_B3DLC3_POSITION                    equ 0003h
B3DLC_B3DLC3_SIZE                        equ 0001h
B3DLC_B3DLC3_LENGTH                      equ 0001h
B3DLC_B3DLC3_MASK                        equ 0008h
B3DLC_B3RB0_POSN                         equ 0004h
B3DLC_B3RB0_POSITION                     equ 0004h
B3DLC_B3RB0_SIZE                         equ 0001h
B3DLC_B3RB0_LENGTH                       equ 0001h
B3DLC_B3RB0_MASK                         equ 0010h
B3DLC_B3RB1_POSN                         equ 0005h
B3DLC_B3RB1_POSITION                     equ 0005h
B3DLC_B3RB1_SIZE                         equ 0001h
B3DLC_B3RB1_LENGTH                       equ 0001h
B3DLC_B3RB1_MASK                         equ 0020h
B3DLC_B3RXRTR_POSN                       equ 0006h
B3DLC_B3RXRTR_POSITION                   equ 0006h
B3DLC_B3RXRTR_SIZE                       equ 0001h
B3DLC_B3RXRTR_LENGTH                     equ 0001h
B3DLC_B3RXRTR_MASK                       equ 0040h

// Register: B3D0
#define B3D0 B3D0
B3D0                                     equ 0E56h
// bitfield definitions
B3D0_B3D00_POSN                          equ 0000h
B3D0_B3D00_POSITION                      equ 0000h
B3D0_B3D00_SIZE                          equ 0001h
B3D0_B3D00_LENGTH                        equ 0001h
B3D0_B3D00_MASK                          equ 0001h
B3D0_B3D01_POSN                          equ 0001h
B3D0_B3D01_POSITION                      equ 0001h
B3D0_B3D01_SIZE                          equ 0001h
B3D0_B3D01_LENGTH                        equ 0001h
B3D0_B3D01_MASK                          equ 0002h
B3D0_B3D02_POSN                          equ 0002h
B3D0_B3D02_POSITION                      equ 0002h
B3D0_B3D02_SIZE                          equ 0001h
B3D0_B3D02_LENGTH                        equ 0001h
B3D0_B3D02_MASK                          equ 0004h
B3D0_B3D03_POSN                          equ 0003h
B3D0_B3D03_POSITION                      equ 0003h
B3D0_B3D03_SIZE                          equ 0001h
B3D0_B3D03_LENGTH                        equ 0001h
B3D0_B3D03_MASK                          equ 0008h
B3D0_B3D04_POSN                          equ 0004h
B3D0_B3D04_POSITION                      equ 0004h
B3D0_B3D04_SIZE                          equ 0001h
B3D0_B3D04_LENGTH                        equ 0001h
B3D0_B3D04_MASK                          equ 0010h
B3D0_B3D05_POSN                          equ 0005h
B3D0_B3D05_POSITION                      equ 0005h
B3D0_B3D05_SIZE                          equ 0001h
B3D0_B3D05_LENGTH                        equ 0001h
B3D0_B3D05_MASK                          equ 0020h
B3D0_B3D06_POSN                          equ 0006h
B3D0_B3D06_POSITION                      equ 0006h
B3D0_B3D06_SIZE                          equ 0001h
B3D0_B3D06_LENGTH                        equ 0001h
B3D0_B3D06_MASK                          equ 0040h
B3D0_B3D07_POSN                          equ 0007h
B3D0_B3D07_POSITION                      equ 0007h
B3D0_B3D07_SIZE                          equ 0001h
B3D0_B3D07_LENGTH                        equ 0001h
B3D0_B3D07_MASK                          equ 0080h

