GopalSaraf/Practicals/PSDL/include/proc/pic18lf4685.inc
// Register: TXB2D3
#define TXB2D3 TXB2D3
TXB2D3                                   equ 0F29h
// bitfield definitions
TXB2D3_TXB2D30_POSN                      equ 0000h
TXB2D3_TXB2D30_POSITION                  equ 0000h
TXB2D3_TXB2D30_SIZE                      equ 0001h
TXB2D3_TXB2D30_LENGTH                    equ 0001h
TXB2D3_TXB2D30_MASK                      equ 0001h
TXB2D3_TXB2D31_POSN                      equ 0001h
TXB2D3_TXB2D31_POSITION                  equ 0001h
TXB2D3_TXB2D31_SIZE                      equ 0001h
TXB2D3_TXB2D31_LENGTH                    equ 0001h
TXB2D3_TXB2D31_MASK                      equ 0002h
TXB2D3_TXB2D32_POSN                      equ 0002h
TXB2D3_TXB2D32_POSITION                  equ 0002h
TXB2D3_TXB2D32_SIZE                      equ 0001h
TXB2D3_TXB2D32_LENGTH                    equ 0001h
TXB2D3_TXB2D32_MASK                      equ 0004h
TXB2D3_TXB2D33_POSN                      equ 0003h
TXB2D3_TXB2D33_POSITION                  equ 0003h
TXB2D3_TXB2D33_SIZE                      equ 0001h
TXB2D3_TXB2D33_LENGTH                    equ 0001h
TXB2D3_TXB2D33_MASK                      equ 0008h
TXB2D3_TXB2D34_POSN                      equ 0004h
TXB2D3_TXB2D34_POSITION                  equ 0004h
TXB2D3_TXB2D34_SIZE                      equ 0001h
TXB2D3_TXB2D34_LENGTH                    equ 0001h
TXB2D3_TXB2D34_MASK                      equ 0010h
TXB2D3_TXB2D35_POSN                      equ 0005h
TXB2D3_TXB2D35_POSITION                  equ 0005h
TXB2D3_TXB2D35_SIZE                      equ 0001h
TXB2D3_TXB2D35_LENGTH                    equ 0001h
TXB2D3_TXB2D35_MASK                      equ 0020h
TXB2D3_TXB2D36_POSN                      equ 0006h
TXB2D3_TXB2D36_POSITION                  equ 0006h
TXB2D3_TXB2D36_SIZE                      equ 0001h
TXB2D3_TXB2D36_LENGTH                    equ 0001h
TXB2D3_TXB2D36_MASK                      equ 0040h
TXB2D3_TXB2D37_POSN                      equ 0007h
TXB2D3_TXB2D37_POSITION                  equ 0007h
TXB2D3_TXB2D37_SIZE                      equ 0001h
TXB2D3_TXB2D37_LENGTH                    equ 0001h
TXB2D3_TXB2D37_MASK                      equ 0080h

// Register: TXB2D4
#define TXB2D4 TXB2D4
TXB2D4                                   equ 0F2Ah
// bitfield definitions
TXB2D4_TXB2D40_POSN                      equ 0000h
TXB2D4_TXB2D40_POSITION                  equ 0000h
TXB2D4_TXB2D40_SIZE                      equ 0001h
TXB2D4_TXB2D40_LENGTH                    equ 0001h
TXB2D4_TXB2D40_MASK                      equ 0001h
TXB2D4_TXB2D41_POSN                      equ 0001h
TXB2D4_TXB2D41_POSITION                  equ 0001h
TXB2D4_TXB2D41_SIZE                      equ 0001h
TXB2D4_TXB2D41_LENGTH                    equ 0001h
TXB2D4_TXB2D41_MASK                      equ 0002h
TXB2D4_TXB2D42_POSN                      equ 0002h
TXB2D4_TXB2D42_POSITION                  equ 0002h
TXB2D4_TXB2D42_SIZE                      equ 0001h
TXB2D4_TXB2D42_LENGTH                    equ 0001h
TXB2D4_TXB2D42_MASK                      equ 0004h
TXB2D4_TXB2D43_POSN                      equ 0003h
TXB2D4_TXB2D43_POSITION                  equ 0003h
TXB2D4_TXB2D43_SIZE                      equ 0001h
TXB2D4_TXB2D43_LENGTH                    equ 0001h
TXB2D4_TXB2D43_MASK                      equ 0008h
TXB2D4_TXB2D44_POSN                      equ 0004h
TXB2D4_TXB2D44_POSITION                  equ 0004h
TXB2D4_TXB2D44_SIZE                      equ 0001h
TXB2D4_TXB2D44_LENGTH                    equ 0001h
TXB2D4_TXB2D44_MASK                      equ 0010h
TXB2D4_TXB2D45_POSN                      equ 0005h
TXB2D4_TXB2D45_POSITION                  equ 0005h
TXB2D4_TXB2D45_SIZE                      equ 0001h
TXB2D4_TXB2D45_LENGTH                    equ 0001h
TXB2D4_TXB2D45_MASK                      equ 0020h
TXB2D4_TXB2D46_POSN                      equ 0006h
TXB2D4_TXB2D46_POSITION                  equ 0006h
TXB2D4_TXB2D46_SIZE                      equ 0001h
TXB2D4_TXB2D46_LENGTH                    equ 0001h
TXB2D4_TXB2D46_MASK                      equ 0040h
TXB2D4_TXB2D47_POSN                      equ 0007h
TXB2D4_TXB2D47_POSITION                  equ 0007h
TXB2D4_TXB2D47_SIZE                      equ 0001h
TXB2D4_TXB2D47_LENGTH                    equ 0001h
TXB2D4_TXB2D47_MASK                      equ 0080h

// Register: TXB2D5
#define TXB2D5 TXB2D5
TXB2D5                                   equ 0F2Bh
// bitfield definitions
TXB2D5_TXB2D50_POSN                      equ 0000h
TXB2D5_TXB2D50_POSITION                  equ 0000h
TXB2D5_TXB2D50_SIZE                      equ 0001h
TXB2D5_TXB2D50_LENGTH                    equ 0001h
TXB2D5_TXB2D50_MASK                      equ 0001h
TXB2D5_TXB2D51_POSN                      equ 0001h
TXB2D5_TXB2D51_POSITION                  equ 0001h
TXB2D5_TXB2D51_SIZE                      equ 0001h
TXB2D5_TXB2D51_LENGTH                    equ 0001h
TXB2D5_TXB2D51_MASK                      equ 0002h
TXB2D5_TXB2D52_POSN                      equ 0002h
TXB2D5_TXB2D52_POSITION                  equ 0002h
TXB2D5_TXB2D52_SIZE                      equ 0001h
TXB2D5_TXB2D52_LENGTH                    equ 0001h
TXB2D5_TXB2D52_MASK                      equ 0004h
TXB2D5_TXB2D53_POSN                      equ 0003h
TXB2D5_TXB2D53_POSITION                  equ 0003h
TXB2D5_TXB2D53_SIZE                      equ 0001h
TXB2D5_TXB2D53_LENGTH                    equ 0001h
TXB2D5_TXB2D53_MASK                      equ 0008h
TXB2D5_TXB2D54_POSN                      equ 0004h
TXB2D5_TXB2D54_POSITION                  equ 0004h
TXB2D5_TXB2D54_SIZE                      equ 0001h
TXB2D5_TXB2D54_LENGTH                    equ 0001h
TXB2D5_TXB2D54_MASK                      equ 0010h
TXB2D5_TXB2D55_POSN                      equ 0005h
TXB2D5_TXB2D55_POSITION                  equ 0005h
TXB2D5_TXB2D55_SIZE                      equ 0001h
TXB2D5_TXB2D55_LENGTH                    equ 0001h
TXB2D5_TXB2D55_MASK                      equ 0020h
TXB2D5_TXB2D56_POSN                      equ 0006h
TXB2D5_TXB2D56_POSITION                  equ 0006h
TXB2D5_TXB2D56_SIZE                      equ 0001h
TXB2D5_TXB2D56_LENGTH                    equ 0001h
TXB2D5_TXB2D56_MASK                      equ 0040h
TXB2D5_TXB2D57_POSN                      equ 0007h
TXB2D5_TXB2D57_POSITION                  equ 0007h
TXB2D5_TXB2D57_SIZE                      equ 0001h
TXB2D5_TXB2D57_LENGTH                    equ 0001h
TXB2D5_TXB2D57_MASK                      equ 0080h

// Register: TXB2D6
#define TXB2D6 TXB2D6
TXB2D6                                   equ 0F2Ch
// bitfield definitions
TXB2D6_TXB2D60_POSN                      equ 0000h
TXB2D6_TXB2D60_POSITION                  equ 0000h
TXB2D6_TXB2D60_SIZE                      equ 0001h
TXB2D6_TXB2D60_LENGTH                    equ 0001h
TXB2D6_TXB2D60_MASK                      equ 0001h
TXB2D6_TXB2D61_POSN                      equ 0001h
TXB2D6_TXB2D61_POSITION                  equ 0001h
TXB2D6_TXB2D61_SIZE                      equ 0001h
TXB2D6_TXB2D61_LENGTH                    equ 0001h
TXB2D6_TXB2D61_MASK                      equ 0002h
TXB2D6_TXB2D62_POSN                      equ 0002h
TXB2D6_TXB2D62_POSITION                  equ 0002h
TXB2D6_TXB2D62_SIZE                      equ 0001h
TXB2D6_TXB2D62_LENGTH                    equ 0001h
TXB2D6_TXB2D62_MASK                      equ 0004h
TXB2D6_TXB2D63_POSN                      equ 0003h
TXB2D6_TXB2D63_POSITION                  equ 0003h
TXB2D6_TXB2D63_SIZE                      equ 0001h
TXB2D6_TXB2D63_LENGTH                    equ 0001h
TXB2D6_TXB2D63_MASK                      equ 0008h
TXB2D6_TXB2D64_POSN                      equ 0004h
TXB2D6_TXB2D64_POSITION                  equ 0004h
TXB2D6_TXB2D64_SIZE                      equ 0001h
TXB2D6_TXB2D64_LENGTH                    equ 0001h
TXB2D6_TXB2D64_MASK                      equ 0010h
TXB2D6_TXB2D65_POSN                      equ 0005h
TXB2D6_TXB2D65_POSITION                  equ 0005h
TXB2D6_TXB2D65_SIZE                      equ 0001h
TXB2D6_TXB2D65_LENGTH                    equ 0001h
TXB2D6_TXB2D65_MASK                      equ 0020h
TXB2D6_TXB2D66_POSN                      equ 0006h
TXB2D6_TXB2D66_POSITION                  equ 0006h
TXB2D6_TXB2D66_SIZE                      equ 0001h
TXB2D6_TXB2D66_LENGTH                    equ 0001h
TXB2D6_TXB2D66_MASK                      equ 0040h
TXB2D6_TXB2D67_POSN                      equ 0007h
TXB2D6_TXB2D67_POSITION                  equ 0007h
TXB2D6_TXB2D67_SIZE                      equ 0001h
TXB2D6_TXB2D67_LENGTH                    equ 0001h
TXB2D6_TXB2D67_MASK                      equ 0080h

// Register: TXB2D7
#define TXB2D7 TXB2D7
TXB2D7                                   equ 0F2Dh
// bitfield definitions
TXB2D7_TXB2D70_POSN                      equ 0000h
TXB2D7_TXB2D70_POSITION                  equ 0000h
TXB2D7_TXB2D70_SIZE                      equ 0001h
TXB2D7_TXB2D70_LENGTH                    equ 0001h
TXB2D7_TXB2D70_MASK                      equ 0001h
TXB2D7_TXB2D71_POSN                      equ 0001h
TXB2D7_TXB2D71_POSITION                  equ 0001h
TXB2D7_TXB2D71_SIZE                      equ 0001h
TXB2D7_TXB2D71_LENGTH                    equ 0001h
TXB2D7_TXB2D71_MASK                      equ 0002h
TXB2D7_TXB2D72_POSN                      equ 0002h
TXB2D7_TXB2D72_POSITION                  equ 0002h
TXB2D7_TXB2D72_SIZE                      equ 0001h
TXB2D7_TXB2D72_LENGTH                    equ 0001h
TXB2D7_TXB2D72_MASK                      equ 0004h
TXB2D7_TXB2D73_POSN                      equ 0003h
TXB2D7_TXB2D73_POSITION                  equ 0003h
TXB2D7_TXB2D73_SIZE                      equ 0001h
TXB2D7_TXB2D73_LENGTH                    equ 0001h
TXB2D7_TXB2D73_MASK                      equ 0008h
TXB2D7_TXB2D74_POSN                      equ 0004h
TXB2D7_TXB2D74_POSITION                  equ 0004h
TXB2D7_TXB2D74_SIZE                      equ 0001h
TXB2D7_TXB2D74_LENGTH                    equ 0001h
TXB2D7_TXB2D74_MASK                      equ 0010h
TXB2D7_TXB2D75_POSN                      equ 0005h
TXB2D7_TXB2D75_POSITION                  equ 0005h
TXB2D7_TXB2D75_SIZE                      equ 0001h
TXB2D7_TXB2D75_LENGTH                    equ 0001h
TXB2D7_TXB2D75_MASK                      equ 0020h
TXB2D7_TXB2D76_POSN                      equ 0006h
TXB2D7_TXB2D76_POSITION                  equ 0006h
TXB2D7_TXB2D76_SIZE                      equ 0001h
TXB2D7_TXB2D76_LENGTH                    equ 0001h
TXB2D7_TXB2D76_MASK                      equ 0040h
TXB2D7_TXB2D77_POSN                      equ 0007h
TXB2D7_TXB2D77_POSITION                  equ 0007h
TXB2D7_TXB2D77_SIZE                      equ 0001h
TXB2D7_TXB2D77_LENGTH                    equ 0001h
TXB2D7_TXB2D77_MASK                      equ 0080h

